In [2]:
import pandas as pd

New Lecture Friday 7/2/25

In [3]:
# Dataframes:--->multidimensional data set/multiple rows and columns

mydata={
    "names":["Sara","Ahmed","Seema","Fatima"],
    "marks1":[64,57,43,67],
    "marks2":[76,78,85,97]
}

In [4]:
students_data=pd.DataFrame(mydata)
print(students_data)

    names  marks1  marks2
0    Sara      64      76
1   Ahmed      57      78
2   Seema      43      85
3  Fatima      67      97

In [5]:
# series:---> series one dimensional data column

info={
    "name":"Atiqa",
    "Profession":"Student",
    "Domain":"AI",
    "marks": 98
}

data_series=pd.Series(info)
print(data_series)

name            Atiqa
Profession    Student
Domain             AI
marks              98
dtype: object

In [6]:
mydata={
    "names":["Sara","Ahmed","Seema","Fatima"],
    "marks1":[64,57,43,67],
    "marks2":[76,78,85,97]
}

df_mydata=pd.DataFrame(mydata)
x=df_mydata['names']
print(x)

x=df_mydata['marks1']
print(x)

0      Sara
1     Ahmed
2     Seema
3    Fatima
Name: names, dtype: object
0    64
1    57
2    43
3    67
Name: marks1, dtype: int64

In [7]:
a=[1,2,3,4,5]
index_lable=['a','b','c','d','e']
anss=pd.Series(a, index=index_lable)
print(anss)
print(anss.loc['d'])

a    1
b    2
c    3
d    4
e    5
dtype: int64
4

In [8]:
data={"names":"Sara",
      "Age":23,
      "mrx":34
      }

print(pd.Series(data))

names    Sara
Age        23
mrx        34
dtype: object

In [9]:
list=[1,2,3,5]
labels=['first','second','third','fourth']
series=pd.Series(list, index=labels)
print(series)

first     1
second    2
third     3
fourth    5
dtype: int64

In [10]:
print(series['first'])
print(series['second'])

1
2

In [11]:
print(series[:3])
print("-"*30)
print(series[2:])
print("-"*30)
print(series[:])

first     1
second    2
third     3
dtype: int64
------------------------------
third     3
fourth    5
dtype: int64
------------------------------
first     1
second    2
third     3
fourth    5
dtype: int64

In [12]:
# series operations
print(series+3)
print(series*3)
print(series)

first     4
second    5
third     6
fourth    8
dtype: int64
first      3
second     6
third      9
fourth    15
dtype: int64
first     1
second    2
third     3
fourth    5
dtype: int64

In [13]:
print(series[series%2==0])
print("------------------")
print(series[series>2])

second    2
dtype: int64
------------------
third     3
fourth    5
dtype: int64

In [80]:
import pandas as pd

mydata={
    "names":["Sara","Ahmed","Seema","Fatima"],
    "marks1":[64,57,43,67],
    "marks2":[76,78,85,97]
}

In [81]:
df=pd.DataFrame(mydata)
print(df)

    names  marks1  marks2
0    Sara      64      76
1   Ahmed      57      78
2   Seema      43      85
3  Fatima      67      97

In [86]:
mydata['Age']=[23, 12, 43, 33]
mydata['ph#no']=[145565778,452566778,987565443,233567788]
print(df)

    names  marks1  marks2
0    Sara      64      76
1   Ahmed      57      78
2   Seema      43      85
3  Fatima      67      97

New Lecture Monday 10/2/25

In [88]:
# iloc is used to find the exact location od the required data
# iloc ----> integer location
# it also accept row index and colunm
# iloc only accept integer based index

# print(df.iloc[1])
print('-'*30)
print(" value at Row1 column3:\n ",df.iloc[1:,:])

------------------------------
 value at Row1 column3:
      names  marks1  marks2
1   Ahmed      57      78
2   Seema      43      85
3  Fatima      67      97

In [90]:
print(df.iloc[:4]) #----> accessing multiple vlues

    names  marks1  marks2
0    Sara      64      76
1   Ahmed      57      78
2   Seema      43      85
3  Fatima      67      97

In [94]:
print(df)
print()
print(df.iloc[1:4,0:4])

    names  marks1  marks2
0    Sara      64      76
1   Ahmed      57      78
2   Seema      43      85
3  Fatima      67      97

    names  marks1  marks2
1   Ahmed      57      78
2   Seema      43      85
3  Fatima      67      97

In [104]:
print(df.iloc[0:2, [1]]) 
print("----------------")
print(df.iloc[0:2, 1])

   marks1
0      64
1      57
----------------
0    64
1    57
Name: marks1, dtype: int64

In [97]:
print(df.iloc[:,[-1]])

   marks2
0      76
1      78
2      85
3      97

In [106]:
# filtered=df[df['Age']>30]

In [ ]:
# print(filtered.iloc[:2])

In [113]:
print(df)
df1=pd.DataFrame(mydata, index=["A","B","C","D"])
print()
print(df1)
print()
print(df1.loc['A'])

    names  marks1  marks2
0    Sara      64      76
1   Ahmed      57      78
2   Seema      43      85
3  Fatima      67      97

    names  marks1  marks2  Age      ph#no
A    Sara      64      76   23  145565778
B   Ahmed      57      78   12  452566778
C   Seema      43      85   43  987565443
D  Fatima      67      97   33  233567788

names          Sara
marks1           64
marks2           76
Age              23
ph#no     145565778
Name: A, dtype: object

In [114]:
print(df1.loc[['A','D']])   #----> multiple aalues are accessible in loc using labeled index

    names  marks1  marks2  Age      ph#no
A    Sara      64      76   23  145565778
D  Fatima      67      97   33  233567788

In [115]:
print(df1.loc[['A','B'],['names','Age']])

   names  Age
A   Sara   23
B  Ahmed   12

In [125]:

print(df1.loc[:,['names']])

    names
A    Sara
B   Ahmed
C   Seema
D  Fatima

In [126]:
data={
    'name':['Ahmed','Sana','Sohail','Rida'],
    'Age':[32,23,34,45],
    'marks':[34,45,64,67],
    'Weight':[30,34,45,32]
}

In [128]:
df=pd.DataFrame(data)
print(df)
print()
print(df.iloc[2:])
print()
print(df.iloc[2,[3]])

     name  Age  marks  Weight
0   Ahmed   32     34      30
1    Sana   23     45      34
2  Sohail   34     64      45
3    Rida   45     67      32

     name  Age  marks  Weight
2  Sohail   34     64      45
3    Rida   45     67      32

Weight    45
Name: 2, dtype: object

In [129]:

import pandas as pd
x=df.iloc[:,1]
print(x)
print(type(x))  #----> series
print("---------------------------")
x=df.iloc[:,:4]
print(x)
print(type(x))#-------> Dataframes

0    32
1    23
2    34
3    45
Name: Age, dtype: int64
<class 'pandas.core.series.Series'>
---------------------------
     name  Age  marks  Weight
0   Ahmed   32     34      30
1    Sana   23     45      34
2  Sohail   34     64      45
3    Rida   45     67      32
<class 'pandas.core.frame.DataFrame'>

In [130]:
#----> read datafrom csv 

path='WHO-COVID-19-global-data.csv'
covid_data=pd.read_csv(path,sep=';')
print(covid_data)

      Date_reported Country_code      Country WHO_region  New_cases  \
0        05/01/2020           AF  Afghanistan       EMRO        NaN
1        12/01/2020           AF  Afghanistan       EMRO        NaN
2        19/01/2020           AF  Afghanistan       EMRO        NaN
3        26/01/2020           AF  Afghanistan       EMRO        NaN
4        02/02/2020           AF  Afghanistan       EMRO        NaN
...             ...          ...          ...        ...        ...
57835    14/07/2024           ZW     Zimbabwe       AFRO        NaN
57836    21/07/2024           ZW     Zimbabwe       AFRO        1.0
57837    28/07/2024           ZW     Zimbabwe       AFRO        NaN
57838    04/08/2024           ZW     Zimbabwe       AFRO        NaN
57839    11/08/2024           ZW     Zimbabwe       AFRO        NaN

       Cumulative_cases  New_deaths Cumulative_deaths,
0                     0         NaN                 0,
1                     0         NaN                 0,
2                     0         NaN                 0,
3                     0         NaN                 0,
4                     0         NaN                 0,
...                 ...         ...                ...
57835            266385         NaN              5740,
57836            266386         NaN              5740,
57837            266386         NaN              5740,
57838            266386         NaN              5740,
57839            266386         NaN              5740,

[57840 rows x 8 columns]

In [ ]:
print(type(covid_data))

<class 'pandas.core.frame.DataFrame'>

In [ ]:
# display(covid_data)
covid_data

,Date_reported,Country_code,Country,WHO_region,New_cases,Cumulative_cases,New_deaths,"Cumulative_deaths,"
0,05/01/2020,AF,Afghanistan,EMRO,NaN,0,NaN,"0,"
1,12/01/2020,AF,Afghanistan,EMRO,NaN,0,NaN,"0,"
2,19/01/2020,AF,Afghanistan,EMRO,NaN,0,NaN,"0,"
3,26/01/2020,AF,Afghanistan,EMRO,NaN,0,NaN,"0,"
4,02/02/2020,AF,Afghanistan,EMRO,NaN,0,NaN,"0,"
...,...,...,...,...,...,...,...,...
57835,14/07/2024,ZW,Zimbabwe,AFRO,NaN,266385,NaN,"5740,"
57836,21/07/2024,ZW,Zimbabwe,AFRO,1.0,266386,NaN,"5740,"
57837,28/07/2024,ZW,Zimbabwe,AFRO,NaN,266386,NaN,"5740,"
57838,04/08/2024,ZW,Zimbabwe,AFRO,NaN,266386,NaN,"5740,"
57839,11/08/2024,ZW,Zimbabwe,AFRO,NaN,266386,NaN,"5740,"

,Date_reported,Country_code,Country,WHO_region,New_cases,Cumulative_cases,New_deaths,"Cumulative_deaths,"
0,05/01/2020,AF,Afghanistan,EMRO,NaN,0,NaN,"0,"
1,12/01/2020,AF,Afghanistan,EMRO,NaN,0,NaN,"0,"
2,19/01/2020,AF,Afghanistan,EMRO,NaN,0,NaN,"0,"
3,26/01/2020,AF,Afghanistan,EMRO,NaN,0,NaN,"0,"
4,02/02/2020,AF,Afghanistan,EMRO,NaN,0,NaN,"0,"
...,...,...,...,...,...,...,...,...
57835,14/07/2024,ZW,Zimbabwe,AFRO,NaN,266385,NaN,"5740,"
57836,21/07/2024,ZW,Zimbabwe,AFRO,1.0,266386,NaN,"5740,"
57837,28/07/2024,ZW,Zimbabwe,AFRO,NaN,266386,NaN,"5740,"
57838,04/08/2024,ZW,Zimbabwe,AFRO,NaN,266386,NaN,"5740,"
57839,11/08/2024,ZW,Zimbabwe,AFRO,NaN,266386,NaN,"5740,"

In [137]:
# .head() will print  first 5 rows of the data
print(covid_data.head().to_string())
# display(covid_data.head())

  Date_reported Country_code      Country WHO_region  New_cases  Cumulative_cases  New_deaths Cumulative_deaths,
0    05/01/2020           AF  Afghanistan       EMRO        NaN                 0         NaN                 0,
1    12/01/2020           AF  Afghanistan       EMRO        NaN                 0         NaN                 0,
2    19/01/2020           AF  Afghanistan       EMRO        NaN                 0         NaN                 0,
3    26/01/2020           AF  Afghanistan       EMRO        NaN                 0         NaN                 0,
4    02/02/2020           AF  Afghanistan       EMRO        NaN                 0         NaN                 0,

In [138]:
# .head(1)  this wll print the first row of index 1 from the data

print(covid_data.head(1).to_string())
print('-'*100)

# .head(1)  this wll print the last row of index 1 from the data
print(covid_data.tail(1).to_string())
print('-'*100)

  Date_reported Country_code      Country WHO_region  New_cases  Cumulative_cases  New_deaths Cumulative_deaths,
0    05/01/2020           AF  Afghanistan       EMRO        NaN                 0         NaN                 0,
----------------------------------------------------------------------------------------------------
      Date_reported Country_code   Country WHO_region  New_cases  Cumulative_cases  New_deaths Cumulative_deaths,
57839    11/08/2024           ZW  Zimbabwe       AFRO        NaN            266386         NaN              5740,
----------------------------------------------------------------------------------------------------

In [139]:
print(covid_data.shape)  #--> print number of rows and columns

(57840, 8)

In [ ]:
x=pd.options.display.max_rows=10
print(x)  
# print(covid_data.to_string())
# print(covid_data.head(x))

10
  Date_reported Country_code      Country WHO_region  New_cases  \
0    05/01/2020           AF  Afghanistan       EMRO        NaN
1    12/01/2020           AF  Afghanistan       EMRO        NaN
2    19/01/2020           AF  Afghanistan       EMRO        NaN
3    26/01/2020           AF  Afghanistan       EMRO        NaN
4    02/02/2020           AF  Afghanistan       EMRO        NaN
5    09/02/2020           AF  Afghanistan       EMRO        NaN
6    16/02/2020           AF  Afghanistan       EMRO        NaN
7    23/02/2020           AF  Afghanistan       EMRO        NaN
8    01/03/2020           AF  Afghanistan       EMRO        1.0
9    08/03/2020           AF  Afghanistan       EMRO        NaN

   Cumulative_cases  New_deaths Cumulative_deaths,
0                 0         NaN                 0,
1                 0         NaN                 0,
2                 0         NaN                 0,
3                 0         NaN                 0,
4                 0         NaN                 0,
5                 0         NaN                 0,
6                 0         NaN                 0,
7                 0         NaN                 0,
8                 1         NaN                 0,
9                 1         NaN                 0,

In [ ]:
print(covid_data.head().to_string())

  Date_reported Country_code      Country WHO_region  New_cases  Cumulative_cases  New_deaths Cumulative_deaths,
0    05/01/2020           AF  Afghanistan       EMRO        NaN                 0         NaN                 0,
1    12/01/2020           AF  Afghanistan       EMRO        NaN                 0         NaN                 0,
2    19/01/2020           AF  Afghanistan       EMRO        NaN                 0         NaN                 0,
3    26/01/2020           AF  Afghanistan       EMRO        NaN                 0         NaN                 0,
4    02/02/2020           AF  Afghanistan       EMRO        NaN                 0         NaN                 0,

In [ ]:
print(covid_data.columns)

Index(['Date_reported', 'Country_code', 'Country', 'WHO_region', 'New_cases',
       'Cumulative_cases', 'New_deaths', 'Cumulative_deaths,'],
      dtype='object')

In [142]:
columns=covid_data.loc[500:1000, ['Country','Date_reported','Cumulative_cases', 'Cumulative_deaths,']]

print(columns.head())
# print(columns.head().to_string())

     Country Date_reported  Cumulative_cases Cumulative_deaths,
500  Algeria    10/05/2020              5558               491,
501  Algeria    17/05/2020              6821               539,
502  Algeria    24/05/2020              8113               589,
503  Algeria    31/05/2020              9267               643,
504  Algeria    07/06/2020             10050               695,

In [145]:
filtered=covid_data[covid_data['Cumulative_cases']>10000]
print(filtered.head().to_string())

   Date_reported Country_code      Country WHO_region  New_cases  Cumulative_cases  New_deaths Cumulative_deaths,
21    31/05/2020           AF  Afghanistan       EMRO     4577.0             14443        37.0               248,
22    07/06/2020           AF  Afghanistan       EMRO     5108.0             19551        79.0               327,
23    14/06/2020           AF  Afghanistan       EMRO     4551.0             24102       124.0               451,
24    21/06/2020           AF  Afghanistan       EMRO     4195.0             28297        97.0               548,
25    28/06/2020           AF  Afghanistan       EMRO     2319.0             30616       155.0               703,

In [ ]:
columns=filtered.loc[1000:10000:500, ['Country','Cumulative_cases', 'Cumulative_deaths,']]
print(columns.head(100).to_string())

                               Country  Cumulative_cases Cumulative_deaths,
1021                           Andorra             10206               105,
2065                         Argentina           9658391            129646,
2682                         Australia             20698               375,
3220                        Azerbaijan            439562              5800,
3809                           Bahrain            696614              1536,
4436                           Belarus            638402              4932,
4999                            Belize             70838               688,
5825  Bolivia (Plurinational State of)            139562              8439,
6478            Bosnia and Herzegovina            403565             16382,
7373                 Brunei Darussalam            229665               133,
8041                           Burundi             15377                12,
8655                          Cambodia            139100              3056,
9297                    Cayman Islands             30214                29,

In [ ]:
# at / iat 

country_at_index=covid_data.at[333,'Country']
print(country_at_index)
country_at_index=covid_data.at[10640,'Country']
print(country_at_index)
country_at_index=covid_data.at[40040,'Country']
print(country_at_index)

Albania
Comoros
Panama

New lecture Tuesday 10/2/25

In [146]:
data1 = pd.DataFrame([['1993', 'Avi', 5, 41, 70, 'Bob'],  
                   ['1994', 'Cathy', 10, 1, 22, 'Cathy'],  
                   ['1995', 'Cathy', 24, 11, 44, 'Bob'],  
                   ['1996', 'Bob', 2, 11, 10, 'Avi'],  
                   ['1998', 'Avi', 20, 10, 40, 'Avi'], 
                   ['1999', 'Avi', 50, 8, 11, 'Cathy']], 
                  columns=('Patients', 'Name', 'Avi', 'Bob', 'Cathy', 'Aname'),index=[1,2,3,4,5,6])

In [ ]:
print(data1)

  Patients   Name  Avi  Bob  Cathy  Aname
1     1993    Avi    5   41     70    Bob
2     1994  Cathy   10    1     22  Cathy
3     1995  Cathy   24   11     44    Bob
4     1996    Bob    2   11     10    Avi
5     1998    Avi   20   10     40    Avi
6     1999    Avi   50    8     11  Cathy

In [147]:
  #----> the poped dta is stored in the variable
  #----> pop only remove column from the original data
  #----> the changes will be reflected in the orriginal data

poped_item=data1.pop('Avi')

In [148]:
print(poped_item)

1     5
2    10
3    24
4     2
5    20
6    50
Name: Avi, dtype: int64

In [149]:
print(data1)   #---dataframe after poped of column 'Avi

  Patients   Name  Bob  Cathy  Aname
1     1993    Avi   41     70    Bob
2     1994  Cathy    1     22  Cathy
3     1995  Cathy   11     44    Bob
4     1996    Bob   11     10    Avi
5     1998    Avi   10     40    Avi
6     1999    Avi    8     11  Cathy

In [150]:
data2 = pd.DataFrame([['1993', 'Avi', 5, 41, 70, 'Bob'],  
                   ['1994', 'Cathy', 10, 1, 22, 'Cathy'],  
                   ['1995', 'Cathy', 24, 11, 44, 'Bob'],  
                   ['1996', 'Bob', 2, 11, 10, 'Avi'],  
                   ['1998', 'Avi', 20, 10, 40, 'Avi'], 
                   ['1999', 'Avi', 50, 8, 11, 'Cathy']], 
                  columns=('Patients', 'Name', 'Avi', 'Bob', 'Cathy', 'Aname'),index=[1,2,3,4,5,6])

In [151]:
# .drop()  ---> this is used to drop row or column from the data
# .drop() will not reflect the changes in original data untill  we use " inplace=True "
# this will create a new dataframe in variable dropped item but will not effect the original data

droped_item=data2.drop(columns=['Aname'])

In [152]:
print("Popped Data")
print("-"*40)
print(droped_item)
print("-"*40)
print("Original Data")
print("-"*40)
print(data2)

Popped Data
----------------------------------------
  Patients   Name  Avi  Bob  Cathy
1     1993    Avi    5   41     70
2     1994  Cathy   10    1     22
3     1995  Cathy   24   11     44
4     1996    Bob    2   11     10
5     1998    Avi   20   10     40
6     1999    Avi   50    8     11
----------------------------------------
Original Data
----------------------------------------
  Patients   Name  Avi  Bob  Cathy  Aname
1     1993    Avi    5   41     70    Bob
2     1994  Cathy   10    1     22  Cathy
3     1995  Cathy   24   11     44    Bob
4     1996    Bob    2   11     10    Avi
5     1998    Avi   20   10     40    Avi
6     1999    Avi   50    8     11  Cathy

In [ ]:
dropped_data=data2.drop(index=[1,4])
print(dropped_data)
print("-"*40)
print(data2)

  Patients   Name  Avi  Bob  Cathy  Aname
2     1994  Cathy   10    1     22  Cathy
3     1995  Cathy   24   11     44    Bob
5     1998    Avi   20   10     40    Avi
6     1999    Avi   50    8     11  Cathy
----------------------------------------
  Patients   Name  Avi  Bob  Cathy  Aname
1     1993    Avi    5   41     70    Bob
2     1994  Cathy   10    1     22  Cathy
3     1995  Cathy   24   11     44    Bob
4     1996    Bob    2   11     10    Avi
5     1998    Avi   20   10     40    Avi
6     1999    Avi   50    8     11  Cathy

In [153]:
print(data2.drop(index=[1,5], inplace=True)) #----> it will not return
# print(dropped_data)
# print("-"*40)

None

In [154]:
print(data2)

  Patients   Name  Avi  Bob  Cathy  Aname
2     1994  Cathy   10    1     22  Cathy
3     1995  Cathy   24   11     44    Bob
4     1996    Bob    2   11     10    Avi
6     1999    Avi   50    8     11  Cathy

In [155]:
print(data2.get('Bob'))

2     1
3    11
4    11
6     8
Name: Bob, dtype: int64

In [156]:
series=(data2['Name'])
print(series)

2    Cathy
3    Cathy
4      Bob
6      Avi
Name: Name, dtype: object

In [157]:
x=pd.Series(data2['Name'].values, index=['a','b','c','d'])
print(x)

a    Cathy
b    Cathy
c      Bob
d      Avi
dtype: object

In [ ]:
x=pd.Series(data2['Name'].values, index=['a','b','c','d'])
print(x)
print("-"*50)
print(data2)

a    Cathy
b    Cathy
c      Bob
d      Avi
dtype: object
--------------------------------------------------
  Patients   Name  Avi  Bob  Cathy  Aname
2     1994  Cathy   10    1     22  Cathy
3     1995  Cathy   24   11     44    Bob
4     1996    Bob    2   11     10    Avi
6     1999    Avi   50    8     11  Cathy

In [158]:
new_data=pd.DataFrame(data2)
new_data.index= ['A','B','C','D']
print(new_data)

  Patients   Name  Avi  Bob  Cathy  Aname
A     1994  Cathy   10    1     22  Cathy
B     1995  Cathy   24   11     44    Bob
C     1996    Bob    2   11     10    Avi
D     1999    Avi   50    8     11  Cathy

In [159]:
print(data2.get('Aname'))
print("-"*50)
print(new_data.get('Bob')>20)

2    Cathy
3      Bob
4      Avi
6    Cathy
Name: Aname, dtype: object
--------------------------------------------------
A    False
B    False
C    False
D    False
Name: Bob, dtype: bool

In [162]:
print("-"*50)
print(new_data[new_data.get('Bob')%2==0])

--------------------------------------------------
  Patients Name  Avi  Bob  Cathy  Aname
D     1999  Avi   50    8     11  Cathy

In [163]:
print(new_data.get(['Name','Patients','Aname']))
print('-'*50)
print(new_data.get(['Name','Patients','Aname']).head(3))

    Name Patients  Aname
A  Cathy     1994  Cathy
B  Cathy     1995    Bob
C    Bob     1996    Avi
D    Avi     1999  Cathy
--------------------------------------------------
    Name Patients  Aname
A  Cathy     1994  Cathy
B  Cathy     1995    Bob
C    Bob     1996    Avi

In [164]:
print(new_data['Patients'].isin([1950]))
print("-"*50)
print(new_data['Patients'].isin(['1994']))
print("-"*50)
print(new_data['Patients'].astype(int).isin([1994]))
print("-"*50)
print(new_data)

A    False
B    False
C    False
D    False
Name: Patients, dtype: bool
--------------------------------------------------
A     True
B    False
C    False
D    False
Name: Patients, dtype: bool
--------------------------------------------------
A     True
B    False
C    False
D    False
Name: Patients, dtype: bool
--------------------------------------------------
  Patients   Name  Avi  Bob  Cathy  Aname
A     1994  Cathy   10    1     22  Cathy
B     1995  Cathy   24   11     44    Bob
C     1996    Bob    2   11     10    Avi
D     1999    Avi   50    8     11  Cathy

In [165]:
f1=new_data ["Name"].isin (["Avi", "Bob"])
f3= new_data['Aname'].isin (["Cathy", "Bob"])
f2=new_data ["Patients"].isin (["1993", "1996"])
# f1 & f2
data=new_data[f1 & f2 | f3]
print(data)

  Patients   Name  Avi  Bob  Cathy  Aname
A     1994  Cathy   10    1     22  Cathy
B     1995  Cathy   24   11     44    Bob
C     1996    Bob    2   11     10    Avi
D     1999    Avi   50    8     11  Cathy

In [166]:
data2.sort_values('Avi')

  Patients   Name  Avi  Bob  Cathy  Aname
4     1996    Bob    2   11     10    Avi
2     1994  Cathy   10    1     22  Cathy
3     1995  Cathy   24   11     44    Bob
6     1999    Avi   50    8     11  Cathy

New Lecture Wednesday 12/2/25

In [170]:

import pandas as pd
data={
    "names":["Sara","Muhammad","Rida","sobia","Saleem","Ali"],
    "Roll_no":[1202,1203,1204,1205,1206,1207],
    "Age":[23,24,22,26,20,28],
    "Domain":["CS","SE","IT","Phy","AI","CS"]
}

In [171]:
df=pd.DataFrame(data)
print(df)

      names  Roll_no  Age Domain
0      Sara     1202   23     CS
1  Muhammad     1203   24     SE
2      Rida     1204   22     IT
3     sobia     1205   26    Phy
4    Saleem     1206   20     AI
5       Ali     1207   28     CS

In [172]:
# columns 

df.columns

Index(['names', 'Roll_no', 'Age', 'Domain'], dtype='object')

In [173]:
# insert new column 
Result_value="pass"
df["Result"]=Result_value
print(df)

      names  Roll_no  Age Domain Result
0      Sara     1202   23     CS   pass
1  Muhammad     1203   24     SE   pass
2      Rida     1204   22     IT   pass
3     sobia     1205   26    Phy   pass
4    Saleem     1206   20     AI   pass
5       Ali     1207   28     CS   pass

In [174]:
new_data={
    'height': [160, 175, 168, 0], 
    'weight': [55, 70, 65, 0]
    }
new_df=pd.DataFrame(new_data)
new_df

   height  weight
0     160      55
1     175      70
2     168      65
3       0       0

In [175]:
result_df=pd.concat([df,new_df], axis=1)

In [26]:
print(result_df)

      names  Roll_no  Age Domain Result  height  weight
0      Sara     1202   23     CS   pass   160.0    55.0
1  Muhammad     1203   24     SE   pass   175.0    70.0
2      Rida     1204   22     IT   pass   168.0    65.0
3     sobia     1205   26    Phy   pass     0.0     0.0
4    Saleem     1206   20     AI   pass     NaN     NaN
5       Ali     1207   28     CS   pass     NaN     NaN

In [176]:
print(df)
print(new_df)

      names  Roll_no  Age Domain Result
0      Sara     1202   23     CS   pass
1  Muhammad     1203   24     SE   pass
2      Rida     1204   22     IT   pass
3     sobia     1205   26    Phy   pass
4    Saleem     1206   20     AI   pass
5       Ali     1207   28     CS   pass
   height  weight
0     160      55
1     175      70
2     168      65
3       0       0

In [177]:
df=pd.DataFrame(data)
df.insert(3,'height',new_df["height"] )
print(df)

      names  Roll_no  Age  height Domain
0      Sara     1202   23   160.0     CS
1  Muhammad     1203   24   175.0     SE
2      Rida     1204   22   168.0     IT
3     sobia     1205   26     0.0    Phy
4    Saleem     1206   20     NaN     AI
5       Ali     1207   28     NaN     CS

In [178]:
df.insert(4,"Weight",pd.Series(new_df['weight']))

In [179]:
print(df)

      names  Roll_no  Age  height  Weight Domain
0      Sara     1202   23   160.0    55.0     CS
1  Muhammad     1203   24   175.0    70.0     SE
2      Rida     1204   22   168.0    65.0     IT
3     sobia     1205   26     0.0     0.0    Phy
4    Saleem     1206   20     NaN     NaN     AI
5       Ali     1207   28     NaN     NaN     CS

In [180]:
df["Birth year"]=[1,2,3,4,5,6]
df

      names  Roll_no  Age  height  Weight Domain  Birth year
0      Sara     1202   23   160.0    55.0     CS           1
1  Muhammad     1203   24   175.0    70.0     SE           2
2      Rida     1204   22   168.0    65.0     IT           3
3     sobia     1205   26     0.0     0.0    Phy           4
4    Saleem     1206   20     NaN     NaN     AI           5
5       Ali     1207   28     NaN     NaN     CS           6

In [181]:
if "Birth Yr" in df.columns:
    # df.drop(columns=["Birth month"], inplace=True)
    # df.drop(columns=["Birth Year"], inplace=True)
    df.drop(columns=["Birth Yr"], inplace=True)
    
# df.insert(5,"Birth year",2025 - df["Age"])

print(df)

      names  Roll_no  Age  height  Weight Domain  Birth year
0      Sara     1202   23   160.0    55.0     CS           1
1  Muhammad     1203   24   175.0    70.0     SE           2
2      Rida     1204   22   168.0    65.0     IT           3
3     sobia     1205   26     0.0     0.0    Phy           4
4    Saleem     1206   20     NaN     NaN     AI           5
5       Ali     1207   28     NaN     NaN     CS           6

In [182]:
if 'status' in df.columns:
    df.drop(columns=['status'], inplace=True)
df.insert(3, 'status', ['Adult' if Age > 18 else 'Minor' for Age in df['Age']])

In [183]:
print(df)

      names  Roll_no  Age status  height  Weight Domain  Birth year
0      Sara     1202   23  Adult   160.0    55.0     CS           1
1  Muhammad     1203   24  Adult   175.0    70.0     SE           2
2      Rida     1204   22  Adult   168.0    65.0     IT           3
3     sobia     1205   26  Adult     0.0     0.0    Phy           4
4    Saleem     1206   20  Adult     NaN     NaN     AI           5
5       Ali     1207   28  Adult     NaN     NaN     CS           6

In [35]:
import numpy as np
df.insert(5,"Random_values", np.random.rand(len(df)))
print(df)

      names  Roll_no  Age status  height  Random_values  Weight Domain  \
0      Sara     1202   23  Adult   160.0       0.602436    55.0     CS
1  Muhammad     1203   24  Adult   175.0       0.437278    70.0     SE
2      Rida     1204   22  Adult   168.0       0.998498    65.0     IT
3     sobia     1205   26  Adult     0.0       0.490385     0.0    Phy
4    Saleem     1206   20  Adult     NaN       0.145876     NaN     AI
5       Ali     1207   28  Adult     NaN       0.552189     NaN     CS

   Birth year
0           1
1           2
2           3
3           4
4           5
5           6

In [184]:
df1 = df.iloc[0:3,:5]
print(df1)

      names  Roll_no  Age status  height
0      Sara     1202   23  Adult   160.0
1  Muhammad     1203   24  Adult   175.0
2      Rida     1204   22  Adult   168.0

In [185]:
df1 = df.iloc[0:3,[0,6]]
print(df1)

      names Domain
0      Sara     CS
1  Muhammad     SE
2      Rida     IT

In [186]:
print(df.iloc[0,0])

Sara

In [187]:
filter=df[df['Age']>20].iloc[:,:]
print(filter)

      names  Roll_no  Age status  height  Weight Domain  Birth year
0      Sara     1202   23  Adult   160.0    55.0     CS           1
1  Muhammad     1203   24  Adult   175.0    70.0     SE           2
2      Rida     1204   22  Adult   168.0    65.0     IT           3
3     sobia     1205   26  Adult     0.0     0.0    Phy           4
5       Ali     1207   28  Adult     NaN     NaN     CS           6

In [188]:
d1=df.set_index('names')
print(d1)

          Roll_no  Age status  height  Weight Domain  Birth year
names
Sara         1202   23  Adult   160.0    55.0     CS           1
Muhammad     1203   24  Adult   175.0    70.0     SE           2
Rida         1204   22  Adult   168.0    65.0     IT           3
sobia        1205   26  Adult     0.0     0.0    Phy           4
Saleem       1206   20  Adult     NaN     NaN     AI           5
Ali          1207   28  Adult     NaN     NaN     CS           6

In [74]:
custom_row=d1.loc['Sara':'Rida']
print(custom_row)

          Roll_no  Age status  height  Random_values  Weight Domain  \
names
Sara         1202   23  Adult   160.0       0.602436    55.0     CS
Muhammad     1203   24  Adult   175.0       0.437278    70.0     SE
Rida         1204   22  Adult   168.0       0.998498    65.0     IT

          Birth year
names
Sara               1
Muhammad           2
Rida               3

In [189]:
custom_row=d1.loc['Muhammad','Domain']
print(custom_row)

SE

New Lecture Thursday 13/2/25

In [ ]:
# Display function  more organized and pretified output

import pandas as pd
data={
    "names":["Sara","Muhammad","Rida","sobia","Saleem","Ali"],
    "Roll_no":[1202,1203,1204,1205,1206,1207],
    "Age":[23,24,22,26,20,28],
    "Domain":["CS","SE","IT","Phy","AI","CS"]
}

In [192]:
stu_df=pd.DataFrame(data)
display(stu_df)

      names  Roll_no  Age Domain
0      Sara     1202   23     CS
1  Muhammad     1203   24     SE
2      Rida     1204   22     IT
3     sobia     1205   26    Phy
4    Saleem     1206   20     AI
5       Ali     1207   28     CS

Filters with Multiple conditions

In [204]:
filter=stu_df.loc[(stu_df['Domain'].str.startswith('A'))]
print(filter)
display(filter)

    names  Roll_no  Age Domain
4  Saleem     1206   20     AI

    names  Roll_no  Age Domain
4  Saleem     1206   20     AI

In [212]:
filter=stu_df.loc[(stu_df['Roll_no'] == 1200)  & (stu_df['Age']==20) | (stu_df['names'].str.endswith('a'))]
print(filter)

   names  Roll_no  Age Domain
0   Sara     1202   23     CS
2   Rida     1204   22     IT
3  sobia     1205   26    Phy

In [ ]:
filter=stu_df.loc[(stu_df['Roll_no'] == 1200)  & ((stu_df['Age']==20) | (stu_df['names'].str.endswith('a')))]
print(filter)

Empty DataFrame
Columns: [names, Roll_no, Age, Domain]
Index: []

In [216]:
import numpy as np
print(stu_df)

      names  Roll_no  Age Domain
0      Sara     1202   23     CS
1  Muhammad     1203   24     SE
2      Rida     1204   22     IT
3     sobia     1205   26    Phy
4    Saleem     1206   20     AI
5       Ali     1207   28     CS

In [220]:
filter=np.where((stu_df['Domain']=="AI") & (stu_df['Age']>=20) )
# print(filter)  --->  where ondition meet that index will be stored 
print(stu_df.loc[filter])

    names  Roll_no  Age Domain
4  Saleem     1206   20     AI

In [1]:
# using .query
# display(stu_df.query('Roll_no  > 1203 & (Age >23 | names.str.startswith("R").values)'))

In [246]:
display(stu_df.query(' (names == "Ali") | ( Domain=="IT" )'))

  names  Roll_no  Age Domain
2  Rida     1204   22     IT
5   Ali     1207   28     CS